{
    "version": "https://jsonfeed.org/version/1",
    "title": "undefined-thought",
    "description": "",
    "home_page_url": "https://marco-fp.github.io/blog",
    "feed_url": "https://marco-fp.github.io/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Marco Fernandez Pranno"
    },
    "items": [
        {
            "id": "https://marco-fp.github.io/blog/how-to-setup-react-native.html",
            "url": "https://marco-fp.github.io/blog/how-to-setup-react-native.html",
            "title": "Getting started with React Native",
            "content_html": "<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>React Native lets you create mobile applications using the same design as React, with javascript. The result is a native mobile application, identical to one written in Objective-C or Java.&nbsp;</p>\n<p>To accomplish this, React Native renders components that translate into native implementations.</p>\n<p>In addition, we'll be able to re-use native code whenever we need to, as easily as importing the file and rendering it as a component in our React Native view.<br><br></p>\n<hr>\n<p>To speed things up, we'll be using&nbsp;<a href=\"https://github.com/react-community/create-react-native-app\">create-react-native-app</a>, a library that will let us build an application without any configuration.&nbsp;</p>\n<p>(Of course, we could set things up manually, but the configuration of things like hot-reloading and optimized builds is out of the scope of this post)</p>\n<p>To complete this quick guide you'll an Android device and computer with an OS capable of running Node and NPM, connected to the same private network (WLAN/LAN).</p>\n<p>Asuming we already have NPM and Node 6.x installed, follow this steps:</p>\n<ol>\n<li>Install <em>create-react-native-app</em> globally\n<blockquote>$&gt; npm install -g create-react-native-app</blockquote>\n</li>\n<li>Initialize and setup the foundation of our first application<br>\n<blockquote>$&gt; create-react-native-app my-first-app</blockquote>\n</li>\n<li>Step into the project's directory and run the project\n<blockquote>$&gt; cd my-first-app/<br>$&gt; npm start</blockquote>\n</li>\n</ol>\n<p>At this point we'll have our application initialized and running and a QR code will be displayed on the terminal.</p>\n<p>It's time to switch to our Android devise, and install&nbsp;<a href=\"https://expo.io/\">Expo</a>. This application will allow us to scan the QR code and synchronize our development environment with the devise.</p>\n<p>Our application will load and render on the device, while we can enable a debugging tool to open on a browser in the computer.</p>\n<p>Since we have hot-reloading out of the box, making a change on our project's files will automatically result in a change on the devise.</p>\n<p>&nbsp;</p>\n<p>If you found this guide useful or have any suggestion, please feel free to share it in the comments.</p>\n<p>Happy hacking!</p>",
            "author": {
                "name": "Marco Fernandez Pranno"
            },
            "tags": [
                   "react-native",
                   "how-to"
            ],
            "date_published": "2017-08-14T23:30:16+02:00",
            "date_modified": "2017-08-14T23:30:08+02:00"
        }
    ]
}
